; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck obj - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-3-3-6)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-1 - location
	p1-2 - location
	p2-3 - location
	p2-5 - location
	p3-2 - location
	p3-7 - location
	p4-6 - location
	p4-7 - location
	p6-2 - location
	p6-5 - location
	p6-8 - location
	p7-9 - location
	p8-3 - location
	p8-5 - location
	p9-4 - location
	)
	(:init
	(at driver1 s9)
	(at driver2 s2)
	(at driver3 s2)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s8)
	(empty truck3)
	(at package1 s5)
	(at package2 s5)
	(at package3 s9)
	(at package4 s3)
	(at package5 s1)
	(at package6 s4)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s4 p4-6)
	(path p4-6 s4)
	(path s6 p4-6)
	(path p4-6 s6)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(path s6 p6-8)
	(path p6-8 s6)
	(path s8 p6-8)
	(path p6-8 s8)
	(path s7 p7-9)
	(path p7-9 s7)
	(path s9 p7-9)
	(path p7-9 s9)
	(path s8 p8-3)
	(path p8-3 s8)
	(path s3 p8-3)
	(path p8-3 s3)
	(path s8 p8-5)
	(path p8-5 s8)
	(path s5 p8-5)
	(path p8-5 s5)
	(path s9 p9-4)
	(path p9-4 s9)
	(path s4 p9-4)
	(path p9-4 s4)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s0 s5)
	(link s5 s0)
	(link s0 s7)
	(link s7 s0)
	(link s0 s8)
	(link s8 s0)
	(link s1 s3)
	(link s3 s1)
	(link s1 s5)
	(link s5 s1)
	(link s1 s6)
	(link s6 s1)
	(link s2 s3)
	(link s3 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s9)
	(link s9 s3)
	(link s4 s1)
	(link s1 s4)
	(link s4 s9)
	(link s9 s4)
	(link s5 s4)
	(link s4 s5)
	(link s6 s3)
	(link s3 s6)
	(link s6 s4)
	(link s4 s6)
	(link s6 s5)
	(link s5 s6)
	(link s7 s1)
	(link s1 s7)
	(link s7 s6)
	(link s6 s7)
	(link s7 s8)
	(link s8 s7)
	(link s8 s1)
	(link s1 s8)
	(link s8 s4)
	(link s4 s8)
	(link s8 s6)
	(link s6 s8)
	(link s9 s7)
	(link s7 s9)
	(link s9 s8)
	(link s8 s9)
)
	(:goal (and
	(at driver3 s1)
	(at truck1 s6)
	(at truck3 s3)
	(at package1 s0)
	(at package2 s0)
	(at package3 s4)
	(at package4 s4)
	(at package5 s3)
	(at package6 s5)
	))
(:metric minimize (total-time))
)

; plan
1. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 0 of 9
2. (drive-truck truck1 s2 s3 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 0 of 9
3. (load-truck package4 truck1 s3)
   deleted: (at package4 s3)
   added: (in package4 truck1)
   goals met: 0 of 9
4. (drive-truck truck1 s3 s9 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s9)
   goals met: 0 of 9
5. (load-truck package3 truck1 s9)
   deleted: (at package3 s9)
   added: (in package3 truck1)
   goals met: 0 of 9
6. (drive-truck truck1 s9 s4 driver2)
   deleted: (at truck1 s9)
   added: (at truck1 s4)
   goals met: 0 of 9
7. (load-truck package6 truck1 s4)
   deleted: (at package6 s4)
   added: (in package6 truck1)
   goals met: 0 of 9
8. (unload-truck package4 truck1 s4)
   deleted: (in package4 truck1)
   added: (at package4 s4)
   goals met: 1 of 9
9. (unload-truck package3 truck1 s4)
   deleted: (in package3 truck1)
   added: (at package3 s4)
   goals met: 2 of 9
10. (drive-truck truck1 s4 s5 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s5)
   goals met: 2 of 9
11. (load-truck package2 truck1 s5)
   deleted: (at package2 s5)
   added: (in package2 truck1)
   goals met: 2 of 9
12. (load-truck package1 truck1 s5)
   deleted: (at package1 s5)
   added: (in package1 truck1)
   goals met: 2 of 9
13. (unload-truck package6 truck1 s5)
   deleted: (in package6 truck1)
   added: (at package6 s5)
   goals met: 3 of 9
14. (drive-truck truck1 s5 s0 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 3 of 9
15. (walk driver3 s2 p1-2)
   deleted: (at driver3 s2)
   added: (at driver3 p1-2)
   goals met: 3 of 9
16. (unload-truck package2 truck1 s0)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   goals met: 4 of 9
17. (unload-truck package1 truck1 s0)
   deleted: (in package1 truck1)
   added: (at package1 s0)
   goals met: 5 of 9
18. (drive-truck truck1 s0 s1 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 5 of 9
19. (drive-truck truck1 s1 s6 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s6)
   goals met: 6 of 9
20. (disembark-truck driver2 truck1 s6)
   deleted: (driving driver2 truck1)
   added: (at driver2 s6) (empty truck1)
   goals met: 6 of 9
21. (walk driver2 s6 p6-8)
   deleted: (at driver2 s6)
   added: (at driver2 p6-8)
   goals met: 6 of 9
22. (walk driver2 p6-8 s8)
   deleted: (at driver2 p6-8)
   added: (at driver2 s8)
   goals met: 6 of 9
23. (board-truck driver2 truck3 s8)
   deleted: (at driver2 s8) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 6 of 9
24. (drive-truck truck3 s8 s1 driver2)
   deleted: (at truck3 s8)
   added: (at truck3 s1)
   goals met: 6 of 9
25. (load-truck package5 truck3 s1)
   deleted: (at package5 s1)
   added: (in package5 truck3)
   goals met: 6 of 9
26. (drive-truck truck3 s1 s3 driver2)
   deleted: (at truck3 s1)
   added: (at truck3 s3)
   goals met: 7 of 9
27. (unload-truck package5 truck3 s3)
   deleted: (in package5 truck3)
   added: (at package5 s3)
   goals met: 8 of 9
28. (walk driver3 p1-2 s1)
   deleted: (at driver3 p1-2)
   added: (at driver3 s1)
   goals met: 9 of 9
